# Principais modulos Python para analise de dados

## Pandas

O Excel do Python, permite maniopulacoes de dataframes, datasets, limpeza de arquivos, preparacao de dados para analise

### Series e DataFrames

#### Series

Contempla um array com valores e um array com indices(labels)

In [1]:
from pandas import Series

In [2]:
#Criando uma serie
obj = Series([67,778,-56,13])
obj

0     67
1    778
2    -56
3     13
dtype: int64

In [3]:
#mostrando valores
obj.values

array([ 67, 778, -56,  13])

In [5]:
#mostrando indices
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
#definindo indices
obj2 = Series([67,778,-56,13], index=['a','b','c','d'])
obj2

a     67
b    778
c    -56
d     13
dtype: int64

In [7]:
#filtrando todos os objetos em alguma condicao
obj2[obj2>3]

a     67
b    778
d     13
dtype: int64

In [8]:
#filtrando por indice
obj2['b']

778

In [9]:
#Criando serie passando dicionario como parametro
dict = {'futebol':5200,'tenis':5000,'voley':698,'natacao':9999}
obj3 = Series(dict)
obj3

futebol    5200
tenis      5000
voley       698
natacao    9999
dtype: int64

#### DataFrames

Sao estruturas semelhantes a uma tabela contendo uma colecao de colunas em que cada um pode conter um tipo de dado diferente

In [10]:
from pandas import DataFrame

In [12]:
#Criando um dataframe
data = {'estado':['santa catarina','parana','goias','bahia','minas gerais'],
        'ano':[2002,2003,2004,2005,2006],
        'populacao':[1.5,1.7,3.6,2.4,2.9]}

frame = DataFrame(data)
frame

           estado   ano  populacao
0  santa catarina  2002        1.5
1          parana  2003        1.7
2           goias  2004        3.6
3           bahia  2005        2.4
4    minas gerais  2006        2.9

In [13]:
#definindo as colunas
DataFrame(data,columns=['ano','estado','populacao'])

    ano          estado  populacao
0  2002  santa catarina        1.5
1  2003          parana        1.7
2  2004           goias        3.6
3  2005           bahia        2.4
4  2006    minas gerais        2.9

In [14]:
#adicionando colunas ao dataframe
frame2 = DataFrame(data,columns=['ano','estado','populacao','debito'],index=['um','dois','tres','quatro','cinco'])
frame2

         ano          estado  populacao debito
um      2002  santa catarina        1.5    NaN
dois    2003          parana        1.7    NaN
tres    2004           goias        3.6    NaN
quatro  2005           bahia        2.4    NaN
cinco   2006    minas gerais        2.9    NaN

In [15]:
#imprimindo apenas uma coluna do datadframe
frame2['estado']

um        santa catarina
dois              parana
tres               goias
quatro             bahia
cinco       minas gerais
Name: estado, dtype: object

In [16]:
frame.ano

0    2002
1    2003
2    2004
3    2005
4    2006
Name: ano, dtype: int64